{
    "title": "Sb News",
    "link": "",
    "languages": ["Next-js/React", "Typescript", "Axios", "Node-js", "Express", "JWT Token", "BCrypt(para criptar senha)", "MySQL"],
    "description": "<p>Projeto idealizado por mim desde a concepção até a implementação.</p><p>As noticias podem ser filtradas por categorias ou subcategorias, por autor ou pesquisando pelo titulo. Possui seção de noticias mais acessadas para o usuário ver as noticias mais acessadas. </p><p>Pensei nesse site para ser um site onde alguém pode se manter informado e ainda interagir com outros usuário compartilhando suas opiniões sobre o assunto e reagir concordando ou não com a opinião um dos outros. Como em qualquer comunidade, tem que haver controle. Por isso, existe a possibilidade de denunciar um comentário para ser analisado por um administrador. Os administradores configuram as vezes que um usuário poderá ser advertido e silenciado, o controle funciona da seguinte forma:<ul><li>Se for advertido mas do que o limite, será silenciado pelo tempo padrão configurado por um administrador</li><li>Se for silenciado mais vezes do que um administrador colocou como limite, terá sua conta suspensa</li></ul><p>Mas, um administrador pode suspender ou silenciar um usuário diretamente sem o usuário precisar ser denunciado.</p></p><p>Possui tres niveis de acesso: </p><ul><li>Usuario normal</li><li>Usuário administrador</li><li>Usuário editor de noticias</li></ul><p>Usuarios comuns podem comentar, reagir, denunciar outros comentários, mudar suas informações e ver notificações.</p><p>Administradores podem banir, silenciar e advertir usuários e mudar o limite de vezes que o usuário poderá ser advertido ou silenciado.</p><p>Editores de noticias poderam criar, editar e excluir noticias criadas por ele, além de analisar quantas visitas tiveram suas noticias.</p><p>Ainda não está publicado, mas irei publicar em breve.</p>",
    "carousel": ["home-page.png", "read.png", "comments.png", "profile.png", "login.png", "admin.png"]
}